/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package org.sais.chocolat.irc;

/**
 *
 * @author Romulus
 */
public class CharNames {

    public static String[][] chars = new String[][]{{"霊夢", "博麗", "れいむ", "はくれい", "レイム", "ハクレイ", "reimu", "hakurei", "紅白", "巫女", "貧乏巫女", "腋", "靈夢"},
        {"魔理沙", "霧雨", "まりさ", "きりさめ", "マリサ", "キリサメ", "marisa", "kirisame", "白黒", "黒白"},
        {"咲夜", "十六夜", "さくや", "いざよい", "サクヤ", "イザヨイ", "sakuya", "izayoi", "メイド", "pad", "パッド"},
        {"妖夢", "魂魄", "ようむ", "こんぱく", "ヨウム", "コンパク", "youmu", "konpaku", "よーむ", "みょん", "幼夢"},
        {"紫", "ゆかり", "ユカリ", "yukari", "ばばぁ", "ばばあ", "ゆかりん", "すきま", "スキマ"},
        {"アリス", "マーガトロイド", "ありす", "まーがとろいど", "alice", "margatroid"},
        {"レミリア", "れみりあ", "remilia", "レミィ", "れみりあ", "れみりゃ", "おぜうさま", "お嬢様", "レミ"},
        {"幽々子", "西行寺", "ゆゆこ", "さいぎょうじ", "ユユコ", "サイギョウジ", "yuyuko", "saigyouji", "ゆゆ様", "@", "ドリキャス", "ゆっこ", "ゆゆさま", "ゆゆ"},
        {"フランドール", "ふらんどーる", "flandre", "フラン", "ふらん", "妹様"},
        {"パチュリー", "ノーレッジ", "ぱちゅりー", "のーれっじ", "patchouli", "knowledge", "パチュ", "パチェ", "紫もやし", "むらさきもやし", "パッチュ", "パッチェ", "オアチュリー"},
        {"美鈴", "めーりん", "ほん", "meirin", "hong", "めーりん", "くれない", "みすず", "ほん", "みりん", "チャイニーズ", "中国"},
        {"輝夜", "蓬莱山", "かぐや", "ほうらいさん", "カグヤ", "ホウライサン", "kaguya", "houraisan", "てるよ", "ぐや", "家具屋", "姫様", "蓬莱ニート", "にーと", "ニート"},
        {"永琳", "八意", "えいりん", "やごころ", "エイリン", "ヤゴコロ", "eirin", "yagokoro", "えーりん", "師匠", "映倫"},
        {"鈴仙", "優曇華院", "イナバ", "れいせん", "うどんげいん", "いなば", "レイセン", "ウドンゲイン", "reisen", "udongein", "inaba", "うどんげ", "座薬", "うどん", "新参ホイホイ"},
        {"橙", "ちぇん", "チェン", "chen", "だいだい"},
        {"プリズムリバー", "ぷりずむりばー", "prismriver", "プリバ", "虹川", "プリバー", "ぷりば", "ルナサ", "メルラン", "リリカ"},
        {"藍", "ran", "狐", "テンコー", "すっぱ", "スッパ"},
        {"妹紅", "藤原", "もこう", "ふじわらの", "モコウ", "フジワラノ", "mokou", "fujiwarano", "もこー", "もこ", "もこたん", "もうこ", "もっこす", "ふじわら"},
        {"慧音", "上白沢", "けいね", "かみしらさわ", "ケイネ", "カミシラサワ", "keine", "kamishirasawa", "けーね", "きもけーね", "きもいけーね"},
        {"萃香", "伊吹", "すいか", "いぶき", "スイカ", "イブキ", "suika", "ibuki", "西瓜", "suica", "つるぺた"},
        {"諏訪子", "洩矢", "すわこ", "もりや", "スワコ", "モリヤ", "suwako", "moriya", "あーうー", "蛙", "ケロちゃん"},
        {"神奈子", "八坂", "かなこ", "やさか", "カナコ", "ヤサカ", "kanako", "yasaka", "ガンキャノン", "キャノ子様", "オンバシラ"},
        {"早苗", "東風谷", "さなえ", "こちや", "サナエ", "コチヤ", "sanae", "kochiya", "青巫女", "トウフヤ"},
        {"文", "射命丸", "あや", "しゃめいまる", "アヤ", "シャメイマル", "aya", "syameimaru", "写メール", "ブンブン丸", "ブン屋", "あやや"},
        {"小町", "小野塚", "こまち", "おのづか", "コマチ", "オノヅカ", "komachi", "onoduka", "こまっちゃん", "きゃん"},
        {"にとり", "河城", "かわしろ", "ニトリ", "カワシロ", "nitori", "kawashiro", "にとりん", "かっぱ", "nitoro", "ゆとり", "ntr"},
        {"天子", "比那名居", "てんこ", "ドM", "ドＭ", "てんし"},
        {"衣玖", "永江", "いく", "衣玖さん", "ｲｸｻｰﾝ", "いくさん"},
        {"燐", "火焔猫", "おりん"},
        {"空", "うつほ", "おくう", "霊烏路", "うにゅほ"},
        {"こいし", "古明地こいし"},
        {"さとり", "古明地さとり", "さとりん"},
        {"白蓮", "聖", "聖白蓮", "ひじり", "ひじりん"},
        {"星", "寅丸", "寅丸星"},
        {"ぬえ", "封獣", "封獣ぬえ", "鵺"},
        {"小傘", "多々良小傘", "ナス", "なす", "傘"},
        {"ナズーリン", "ナズ", "なず", "ねずみ", "ネズミ", "鼠", "ﾊﾊｯ"},
        {"水蜜", "ムラサ", "村紗", "キャプテン"}
    }
    /*,

        {"チルノ", "ちるの", "cirno", "⑨", "バカ", "馬鹿", "ばか"},
        {"リグル", "ナイトバグ", "りぐる", "ないとばぐ", "wriggle", "nightbug", "りぐるん", "g"},
        {"ミスティア", "ローレライ", "みすてぃあ", "ろーれらい", "mystia", "lorelei", "みすちー", "ミスティ", "みすち", "小骨", "鶏肉"},
        {"幽香", "風見", "ゆうか", "かざみ", "ユウカ", "カザミ", "yuuka", "kazami", "ゆうかりん", "ゆーかちゃん"},
        {"四季映姫", "ヤマザナドゥ", "しきえいき", "やまざなどぅ", "シキエイキ", "shikieiki", "yamaxanadu", "四季", "映姫", "四季様", "映姫様", "えーき", "ザナ様", "ザナたん", "山田", "閻魔様"},
        {"雛", "鍵山", "ひな", "かぎやま", "ヒナ", "カギヤマ", "hina", "kagiyama", "ひなりん", "ドリる", "厄"},
        {"衣玖", "永江", "いく", "ながえ", "イク", "ナガエ", "iku", "nagae", "桑芦源維", "ドリル", "サタデーナイトフィーバー", "ミミガー"},
        {"天子", "比那名居", "てんし", "ひなない", "テンシ", "ヒナナイ", "tenshi", "hinanai", "てんこ", "有頂天子", "ちこりん", "バーミヤン", "オーロラ", "漬物石", "ドッスン", "ドm"},
        {"パルスィ", "水橋", "ぱるすぃ", "みずはし", "ミズハシ", "parsee", "mizuhashi", "橋姫", "ぱるしー", "ぱるちー", "パルスィート", "ぱるぱる", "パルシステム", "農家"},
        {"勇儀", "星熊", "ゆうぎ", "ほしぐま", "ユウギ", "ホシグマ", "yuugi", "hoshiguma", "姐さん", "☆ぐまー", "遊戯"},
        {"さとり", "サトリ", "satori", "さとりん", "ベアード様", "小五ロリ", "ちとりちま"},
        {"燐", "火焔猫", "りん", "かえんびょう", "リン", "カエンビョウ", "rin", "kaenbyou", "おりん", "おりいん", "ゴス猫", "ネコロマンサー", "ヘルにゃん", "にゃーん", "おりんりんランド"},
        {"空", "霊烏路", "うつほ", "れいうじ", "ウツホ", "レイウジ", "utsuho", "reiuji", "おくう", "うにゅほ", "バハムー子", "バカムート", "ダイソン"},
        {"こいし", "コイシ", "koishi", "こいしちゃん", "小石", "恋し", "グリコ", "バスガイド", "荒ぶる鷹のポーズ", "荒ぶるグリコのポーズ"}
    }*/;
}
